Revit 2024 API
BuiltInFailures.StairRampFailures.RailingBadOffset Property
 An arc in the railing sketch has a radius that conflicts with the current rail widths and offsets. Please either increase the radius or modify rail profiles and offsets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RailingBadOffset { get; }
Visual Basic
Public Shared ReadOnly Property RailingBadOffset As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RailingBadOffset {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace